/*
— Создать проект из трёх классов (основной с точкой входа и два класса в другом
пакете), которые вместе должны составлять одну программу, позволяющую
производить четыре основных математических действия и осуществлять
форматированный вывод результатов пользователю:

— Скомпилировать проект, а также создать для этого проекта стандартную
вебстраницу с документацией ко всем пакетам;
 */


public class Main {
    public static void main(String[] args) {
        System.out.println("Hello from java!");
    }

}