
# Урок 1. Лямбды и Stream API



### План урока:

- Лямбда-выражения
- Stream API


## Домашняя работа ([решение](https://github.com/olgashenkel/GeekBrains-technological_specialization/blob/main/03.%20Java%20Junior/Seminar_01/seminar_01/src/main/java/seminar_01/Homework.java))

Напишите программу, которая использует Stream API для обработки списка чисел. Программа должна вывести на экран среднее значение всех четных чисел в списке.

```
Scanner scanner = new Scanner(System.in);
List<Integer> numbers = new ArrayList<>();

System.out.println("Введите несколько чисел, разделяя их пробелами. Для завершения ввода введите нечисловой " +
        "символ и Enter");

while (scanner.hasNextInt()) {
    numbers.add(scanner.nextInt());
}

System.out.println("Создан список чисел:");
for (int num : numbers) {
    System.out.print(num + " ");
}

double average = numbers.stream()
        .filter(n -> n % 2 == 0)
        .mapToInt(n -> n)
        .average()
        .orElse(0.0);

System.out.println("\nСреднее значение всех четных чисел в списке = " + average);
scanner.close();
```
---
## Задачи с семинара

### Задание 1 ([решение](https://github.com/olgashenkel/GeekBrains-technological_specialization/tree/main/03.%20Java%20Junior/Seminar_01/seminar_01/src/main/java/seminar_01/task_01))

Реализовать систему учета книг в библиотеке. У каждой книги есть название, автор и год издания. Необходимо создать список книг и выполнить следующие действия:

1. Обычный способ:
    - Найти все книги, написанные определенным автором (например, "John Doe").
    - Найти все книги, изданные после определенного года (например, 2010).
    - Найти все уникальные названия книг в библиотеке.
2. Использование лямбда-выражений:
   - Те же самые задачи , но с использованием лямбда-выражений и Stream API для более компактного и выразительного кода.


### Задание 2 ([решение](https://github.com/olgashenkel/GeekBrains-technological_specialization/tree/main/03.%20Java%20Junior/Seminar_01/seminar_01/src/main/java/seminar_01/task_02))

Техническое задание на разработку информационной системы UMarketU
Вам доверено спроектировать и реализовать классы предметной области, которые позволят в дальнейшем вести разработку ИС со следующим функционалом:

1. Осуществлять учет продовольственных и непродовольственных товаров, которыми торгует UMarket.
2. Предоставлять покупателям возможность фильтрации продовольственных товаров по следующим видам:
    - Снеки;
    - Полуфабрикаты;
    - Продукты для приготовления;
    - Все продовольственные товары.
3. Формировать онлайн корзину из продовольственных товаров.
4. Осуществлять балансировку онлайн корзины с целью получения такого набора продуктов питания, который включает все основные питательные элементы.

**Особенности бизнес-логики сервиса UMarket.**

Модуль онлайн покупок должен осуществлять контроль за попадающими в покупательскую корзину продуктами, а именно:
- в онлайн корзину можно добавить только продовольственные товары;
- в зависимости от желания покупателя, в онлайн корзине могут находиться как все присутствующие в UMarket продовольственные товары, так и исключительно товары той категории, которую выбрал покупатель посредством настроек фильтрации (фильтрация по видам продовольственных товаров).

Необходимо предусмотреть типобезопасность онлайн корзины, так как в момент "автоматической балансировки" она должна пополняться продовольственными товарами из списка товара UMarket СФУ.

Необходимо учесть, что в случае формирования онлайн корзины конкретного вида продовольственных товаров, дополнять корзину необходимо товарами именно из выбранной покупателями категории продовольственных товаров.

С целью упрощения алгоритма балансировки онлайн корзины, будем считать, что каждый продовольственный продукт содержит всего лишь один питательный элемент: белки / жиры / углеводы.   
Следовательно, усть вероятность, что все выбранные товары будут представителями одного и того же питательного элемента (например, углеводными).   
В свою очередь, балансировка делает так, чтобы в корзине были представлены все питательные элементы.